Repository: ralphrbergman/ralphs-booru
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: lv

source: Can't access this party yet boss.
lv: Jums nav atļauts piekļūt šai ballītei boss.

source: Updated profile successfully
lv: Veiksmīgi atjauninājāt profilu

source: Invalid password provided
lv: Ievadīta nepareiza parole

source: Successfully changed password
lv: Veiksmīgi nomainijāt paroli

source: Incorrect username
lv: Nepareizs lietotājvārds

source: Welcome back, %(name)s
lv: Kā iet, %(name)s?

source: Incorrect password
lv: Nepareiza parole ievadīta

source: Logged out
lv: Izgājāt no profila

source: Failed to create your profile.
lv: Neizdevās izveidot tavu profilu.

source: Welcome, %(name)s
lv: Sveiks, %(name)s

source: You need to login
lv: Jums vajag pieslēgties

source: Unauthorized users prohibited
lv: Pieeja šai lapai ir liegta

source: The resource you we're looking for does not exist.
lv: Lapa ko meklējāt neeksistē.

source: Role with priority %(priority)s does not exist
lv: Loma ar prioritāti %(priority)s neeksistē

source: Cannot manage the user on the same or above rank as you
lv: Nevar pārvaldīt lietotāju kam ir tāda pati loma, vai augstāka loma kā tev

source: Updated user %(name)s successfully!
lv: Atjaunināja lietotāju %(name)s veiksmīgi!

source: Successfully exchanged post #%(post_id)s for a new file!
lv: Veiksmīgi izmainījāt ierakstu #%(post_id)s ar jaunu failu!

source: Failed to exchange post.
lv: Neizdevās izmainīt ierakstu.

source: Successfully uploaded post #%(post_id)s
lv: Veiksmīgi augšupielādējāt ierakstu #%(post_id)s

source: Uploading file %(filename)s failed
lv: Augšupielādējot failu %(filename)s neizdevās

source: Permanently deleted tag #%(tag_name)s
lv: Neatgriezeniski izdzēsāt birku #%(tag_name)s

source: Updated tag %(tag_name)s successfully!
lv: Veiksmīgi atjauninājāt birku %(tag_name)s!

source: Password is required
lv: Ir nepieciešama parole

source: Passwords must be from 8 to 128 characters in length
lv: Parolēm jābūt no 8 līdz 128 rakstzīmēm garām

source: You need to confirm your password
lv: Lūdzu apstiprini savu paroli

source: Mismatch between password and confirmation password
lv: Neatbilstība starp ievadītajām parolēm

source: Username is already taken.
lv: Lietotājvārds ir aizņemts.

source: Please specify which post to search.
lv: Lūdzu izvēlaties kuru ierakstu vēlaties meklēt.

source: Administrator
lv: Lapas administrators

source: A username is required
lv: Lietotājvārds ir nepieciešams

source: Usernames can be up to 20 characters in length
lv: Lietotājvārdi var būt līdz 20 rakstzīmēm garumā

source: Page
lv: Lapaspuse

source: Comments
lv: Komentāri

source: This page displays comments site-wide across all %(post_count)s posts.
lv: Šī lapa satur komentārus starp visiem %(post_count)s ierakstiem.

source: Contact
lv: Sazinies ar mani

source: You can get in touch with me
lv: Jūs varat sazināties ar mani

source: Means
lv: Veids

source: Value
lv: Vērtība

source: E-mail
lv: E-pasts

source: Remove
lv: Atņemt

source: Edit Post
lv: Rediģēt Ierakstu

source: Select this usually when you found a better quality file.
lv: Izvēlaties šo iespēju kad atrodat labākas kvalitātes failu.

source: Replace with
lv: Aizstāt ar

source: Directory
lv: Mape

source: Poster
lv: Autors

source: Open
lv: Atvērt

source: Source
lv: Resurss

source: Caption
lv: Apraksts

source: Tags
lv: Birkas

source: Delete
lv: Izdzēst

source: Submit
lv: Iesniegt

source: Edit Password
lv: Rediģēt Paroli

source: Old Password
lv: Vecā Parole

source: New Password
lv: Jaunā Parole

source: Confirm Password
lv: Apstiprināt Paroli

source: Change
lv: Nomainīt

source: Edit Profile
lv: Rediģēt Profilu

source: Avatar
lv: Bilde

source: Username
lv: Lietotājvārds

source: Password
lv: Parole

source: Your unique API key: %(api_key)s<br><b>(Do not share it with anyone)</b>
lv: Tava unikālā atslēga pieejai REST API: %(api_key)s<br><b>(Nedali nevienam šo atslēgu)</b>

source: Name
lv: Vārds

source: Type
lv: Tips

source: Description
lv: Apraksts

source: Error
lv: Kļūme

source: Oops! You encountered HTTP %(code)s error!
lv: Ak vai! Tu satikies ar HTTP %(code)s kļūmi!

source: Help
lv: Palīdzība

source: Help: Posts
lv: Palīdzēt: Ieraksti

source: A post represents a uploaded file that can be commented on and searched for. Alternatively if you upload a post of your own you can give it original poster and source attributes. More about uploading read <a href="%(upload_href)s">Uploading section</a>, as well as caption and add tags that can be easily searched for as before mentioned. More about tags read <a href="%(tag_href)s">Tags section</a>
lv: Ieraksts reprezentē augšupielādētu failu kuram var likt komentārus, un kuru var atrast caur meklēšanas rīkiem. Alternatīvi ja jūs vēlaties augšupielādēt pašu ierakstu, jūs varat tam iedot publicētāja un resursa attribūtus. Vēl par augšupielādi lasiet <a href="%(upload_href)s">Augšupielādes sekcijā</a>, kā arī pievienot teksta saturu un pievienot birkas kurus var ērti meklēt. Par birkām dziļāk <a href="%(tag_href)s">Birku sekcijā</a>

source: Help: Search
lv: Palīdzēt: Meklēšana

source: You can search for tag <b>%(tag_example)s</b> and it will search for Grand Theft Auto V gameplay posts. Because you put two tags together, alternatively if you don't want gameplay you can add <b>%(minus_tag)s</b> tag with a minus sign in front of tag name instead and it will search for posts that depict GTA V instead of gameplay.
lv: Jūs varat meklēt birkas <b>%(tag_example)s</b> un tas meklēs ierakstus par Grand Theft Auto V datorspēles uzņemto saturu. Jo jūs salikāt divas birkas kopā, alternatīvi ja nevēlaties redzēt uzņemto saturu datorspēlē tad varat pievienot <b>%(minus_tag)s</b> ar mīnusa zīmi priekšā un tas meklēs ierakstus kas satur GTA V idejas un nevis uzņemto saturu.

source: When searching you might want to look at what tags are available, click <a href="%(tag_url)s">here</a>. More about searching look in <a href="%(tag_href)s">Tags in-depth section</a>
lv: Kad meklējat jūs varētu vēlēties apskatīties kādas birkas ir pieejamas noklikšķiniet <a href="%(tag_url)s">šeit</a>. Vairāk par meklēšanu apskatiet <a href="%(tag_href)s">Paplašināti par Birkām</a>

source: Tag
lv: Birka

source: Explanation
lv: Paskaidrojums

source: Search for posts with <b>%(tag)s</b> tag
lv: Meklē ierakstus ar birku <b>%(tag)s</b>

source: Search for posts that don't have the <b>%(tag)s</b> tag
lv: Meklē ierakstus kuriem Nav birka <b>%(tag)s</b>

source: Search for posts that have no tags assigned
lv: Meklē ieraktus kuriem nav neviena birka

source: Search for posts whose width is 1920 pixels
lv: Meklē ierakstus kuriem ir platums 1920 pikseļi

source: Search for posts whose width is above 1919 pixels
lv: Meklē ierakstus kuriem platums ir virs 1919 pikseļiem

source: Search for posts whose height is below 1081 pixels
lv: Meklē ierakstus kuriem garums ir zem 1081 pikseļiem

source: Search for posts that have the words <i>%(word_1)s</i> and <i>%(word_2)s</i> in text, order doesn't matter
lv: Meklē ierakstus kuri satur vārdus <i>%(word_1)s</i> un <i>%(word_2)s</i>, secība nav būtiska

source: Help: In-depth Tags
lv: Palīdzēt: Paplašināti par Birkām

source: Here's a helpful table of available tags and attributes you can use to narrow down your searches.
lv: Šeit ir noderīga tabula ar pieejamām birkām un atribūtiem.

source: Example
lv: Piemērs

source: Search for post whose unique ID is 1
lv: Meklēt ierakstu kuram ID ir 1

source: Match post author's ID
lv: Atrast ierakstus pēc autora ID

source: Match an original poster's username or URL to profile
lv: Atrast ierakstus pēc autora lietotājvārda vai profila hipersaites

source: Match original resource where post was taken from
lv: Atrast resursu no kura ieraksts ir ņemts

source: Search for posts in the "cute" directory
lv: Meklēt ierakstus kuri ir "cute" mapē

source: Match post with MD5 hash sum of <i>%(example_hash)s</i>
lv: Atrast ierakstu kuram MD5 hašs ir <i>%(example_hash)s</i>

source: Match posts with file extension of <i>%(example_format)s</i>
lv: Atrast ierakstus kuriem faila paplašinājums ir <i>%(example_format)s</i>

source: Match posts with MIME type of <i>%(example_format)s</i>
lv: Atrast ierakstus kuriem MĪMU tips ir <i>%(example_format)s</i>

source: Match posts with disk size in bytes of <i>%(example_id)s</i> <br><b>Note it is very hard to get this right so don't bother</b>
lv: Meklēt ierakstus kuri ir <i>%(example_id)s</i> baitu lielumā uz diska<br><b>Piezīme: Šo nebūs vienkārši iegūt</b>

source: Match posts whose height is 1440 pixels
lv: Meklēt ierakstus kuru garums ir 1440 pikseļi

source: Match posts whose width is 2560 pixels
lv: Meklēt ierakstus kuru platums ir 2560 pikseļi

source: Search for image posts
lv: Meklēt tikai attēlus

source: Search for posts uploaded in Year 2026
lv: Meklēt ierakstus publicētus 2026 gadā

source: Search for posts uploaded in October (tenth month)
lv: Meklēt ierakstus publicētus Oktobrī (desmitais mēnesis)

source: Search for posts uploaded on the first day of every month
lv: Meklēt ierakstus kuri ir publicēti pirmajā mēneša dienā

source: Look for posts whose score is 1 point
lv: Meklēt ierakstus kuriem ir viens punkts

source: Match for a post with the file name of <i>%(example_name)s</i>
lv: Atrast ierakstu kura faila vārds ir <i>%(example_name)s</i>

source: Show removed posts
lv: Parādīt izdzēstos ierakstus

source: Help: Uploading
lv: Palīdzēt: Augšupielāde

source: Great, you want to share with your own content, please be aware that we only host high quality memes/other content, if you upload a low quality meme, be warned that it may be removed. And please don't upload content with watermarks, and make sure to attribute the original poster when uploading. You have the tools to do the right thing so you should utilize them. If whenever in doubt you can reach out on our Discord server.
lv: Brīnišķīgi, tu vēlies dalīties ar mums savā saturā, bet esi apzinošs ka mēs glabājam augstas kvalitātes mēmus/citu saturu, ja tu augšupielādē zemas kvalitātes saturu, esi brīdināts ka viņš var tikt izdzēsts. Un lūdzam neaugšupielādēt saturu ar ūdenszīmēm, un pārliecinies ka esi ievietojis oriģinālo autoru kad augšupielādē. Tev ir rīki lai paveiktu izcilu darbu daloties ar saturu, tātad tev viņi ir jāizmanto. Ja jebkad šaubāties jūs varat griezties mūsu Discord kopienā.

source: Help: NSFW
lv: Palīdzēt: NSFW

source: By default NSFW-related posts are hidden, if you wish to view NSFW and only NSFW posts then you can add <b>%(nsfw_tag)s</b> tag. But please be aware of consequences that come with viewing NSFW posts
lv: Noklusēti Nav Drošs Darbam saturs ir paslēpts, ja vēlaties viņu redzēt, un tikai NSFW saturu redzēt tad pievienojiet birku <b>%(nsfw_tag)s</b>. Bet ņemiet vērā par sekām skatoties NSFW saturu

source: Index
lv: Mājas

source: Search
lv: Meklēt

source: Posts
lv: Ieraksti

source: DO NOT SHARE THIS WITH ANYONE
lv: NEDALIES AR NEVIENU ŠO VĒRTĪBU

source: Ralph's kind of Booru
lv: Ralfa Būru

source: List Users
lv: Lietotāju Katalogs

source: Role
lv: Loma

source: Created
lv: Izveidots

source: Edit
lv: Rediģēt

source: Login
lv: Pieslēgties

source: Remember Me
lv: Atcerēties Mani

source: Manage User
lv: Pārvaldīt Lietotāju

source: Level
lv: Līmenis

source: Join Date
lv: Reģistrējās

source: 's latest posts
lv: jaunākie ieraksti

source: Sign Up
lv: Reģistrēties

source: Upload your own avatar
lv: Augšupielādē savu profila bildi

source: E-mail (Not Required)
lv: E-pasts (Nav Nepieciešams)

source: Sign-Up
lv: Reģistrēties

source: List Snapshots
lv: Momentuzņēmumi

source: Post
lv: Ieraksts

source: Time
lv: Laiks

source: Revert
lv: Atgriezt Atpakaļ

source: Tags Page
lv: Birku Lapaspuse

source: Count
lv: Skaits

source: Tag History
lv: Birku Vēsture

source: Upload
lv: Augšupielādēt

source: File(s)
lv: Failu(s)

source: Upvote
lv: Augšupbalss

source: Downvote
lv: Lejupbalss

source: Statistics
lv: Statistika

source: Posted
lv: Publicēts

source: Uploader
lv: Īpašnieks

source: Size
lv: Izmērs

source: Disk Size
lv: Vieta uz Diska

source: Your comment goes here.
lv: Tavs komentārs šeit.

source: Comment
lv: Komentēt

source: at
lv: komentēja

source: Links
lv: Saites

source: Contact Me
lv: Sazinies ar mani

source: Source Code
lv: Lapas kods

source: For Developers
lv: Priekš Izstrādātājiem

source: Toggle
lv: Pārslēgt

source: Add
lv: Pievienot

source: Browse
lv: Pārlūkot

source: Users
lv: Lietotāji

source: My Profile
lv: Profils

source: Logout
lv: Iziet

source: Blur
lv: Aizmiglot

source: Sort By
lv: Kārtot pēc

source: Modified
lv: Modificēts

source: Hash
lv: Hašs

source: File Extension
lv: Faila Paplašinājums

source: Disk Space
lv: Vieta uz Diska

source: Height
lv: Garums

source: Width
lv: Platums

source: Category
lv: Kategorija

source: Sort
lv: Kārtot

source: Ascending
lv: Augošā sec.

source: Descending
lv: Dilstošā sec.

source: Caption flair
lv: Apraksta piezīme

source: Original Poster flair
lv: Autora piezīme

source: Source flair
lv: Resursa piezīme

source: Original Poster & Source flair
lv: Autora un resursa piezīme

source: Audio flair
lv: Audio piezīme

source: Image flair
lv: Attēla piezīme

source: Video flair
lv: Video piezīme
